Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.MovePosition Method
 Move analysis position.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool MovePosition(
	AnalysisPosition position,
	Vector move
)
Public Function MovePosition (
	position As AnalysisPosition,
	move As Vector
) As Boolean
Parameters
position
Type: Tekla.Structures.Analysis.AnalysisPosition
The analysis position.
move
Type: Tekla.Structures.Geometry3d.Vector
The move.
Return Value
Type: Boolean
True if successful.
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace